package days01;

public class Java_Third {

	public static void main(String[] args) {
		
		System.out.printf("\t\t   ###성적표###\n");
		System.out.printf("----------------------------------------------\n");
		System.out.printf("번호\t성명\t\t국어\t영어\t수학\t총점\t평균\n");
		System.out.printf("----------------------------------------------\n");
		System.out.printf("1\t홍길동\t\t89\t87\t89\t254\t85.2\n");
		System.out.printf("2\t홍길서\t\t87\t55\t89\t241\t80.4\n");
		System.out.printf("3\t홍길남\t\t78\t57\t81\t212\t75.8\n");
		System.out.printf("----------------------------------------------\n");
		
		// System.out.printf() 를 이용해서 다음과 같이 출력하세요
		
		
		//				###성적표###
		// -------------------------------------------
		// 번호	성명		국어	영어	수학	총점	평균
		//	-------------------------------------------
		//	1		홍길동		89		87		89		254	85.2
		//	2		홍길서		87		55		87		243	80.3
		//	3		홍길남		59		88		66		254	82.4
		// --------------------------------------------
		

	}

}
